Revit 2027 API
IFCExtrusionCreationData.ReuseLocalPlacement Property
 Allows re-use of local placement when creating a new local placement due to shifting of breps when moving towards the origin.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ReuseLocalPlacement { get; set; }
Public Property ReuseLocalPlacement As Boolean
	Get
	Set
public:
property bool ReuseLocalPlacement {
	bool get ();
	void set (bool value);
}
member ReuseLocalPlacement : bool with get, set
Property Value
Boolean
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace